{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-BRAND",
    "2": "I-BRAND",
    "3": "B-TYPE",
    "4": "I-TYPE",
    "5": "B-PERCENT",
    "6": "I-PERCENT",
    "7": "B-VOLUME",
    "8": "I-VOLUME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BRAND": 1,
    "B-PERCENT": 5,
    "B-TYPE": 3,
    "B-VOLUME": 7,
    "I-BRAND": 2,
    "I-PERCENT": 6,
    "I-TYPE": 4,
    "I-VOLUME": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
